----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           9,408
       BatchNorm2d-2         [-1, 64, 256, 256]             128
              ReLU-3         [-1, 64, 256, 256]               0
         MaxPool2d-4         [-1, 64, 128, 128]               0
            Conv2d-5         [-1, 64, 128, 128]          36,864
       BatchNorm2d-6         [-1, 64, 128, 128]             128
              ReLU-7         [-1, 64, 128, 128]               0
            Conv2d-8         [-1, 64, 128, 128]          36,864
       BatchNorm2d-9         [-1, 64, 128, 128]             128
             ReLU-10         [-1, 64, 128, 128]               0
       BasicBlock-11         [-1, 64, 128, 128]               0
           Conv2d-12         [-1, 64, 128, 128]          36,864
      BatchNorm2d-13         [-1, 64, 128, 128]             128
             ReLU-14         [-1, 64, 128, 128]               0
           Conv2d-15         [-1, 64, 128, 128]          36,864
      BatchNorm2d-16         [-1, 64, 128, 128]             128
             ReLU-17         [-1, 64, 128, 128]               0
       BasicBlock-18         [-1, 64, 128, 128]               0
           Conv2d-19         [-1, 64, 128, 128]          36,864
      BatchNorm2d-20         [-1, 64, 128, 128]             128
             ReLU-21         [-1, 64, 128, 128]               0
           Conv2d-22         [-1, 64, 128, 128]          36,864
      BatchNorm2d-23         [-1, 64, 128, 128]             128
             ReLU-24         [-1, 64, 128, 128]               0
       BasicBlock-25         [-1, 64, 128, 128]               0
           Conv2d-26          [-1, 128, 64, 64]          73,728
      BatchNorm2d-27          [-1, 128, 64, 64]             256
             ReLU-28          [-1, 128, 64, 64]               0
           Conv2d-29          [-1, 128, 64, 64]         147,456
      BatchNorm2d-30          [-1, 128, 64, 64]             256
           Conv2d-31          [-1, 128, 64, 64]           8,192
      BatchNorm2d-32          [-1, 128, 64, 64]             256
             ReLU-33          [-1, 128, 64, 64]               0
       BasicBlock-34          [-1, 128, 64, 64]               0
           Conv2d-35          [-1, 128, 64, 64]         147,456
      BatchNorm2d-36          [-1, 128, 64, 64]             256
             ReLU-37          [-1, 128, 64, 64]               0
           Conv2d-38          [-1, 128, 64, 64]         147,456
      BatchNorm2d-39          [-1, 128, 64, 64]             256
             ReLU-40          [-1, 128, 64, 64]               0
       BasicBlock-41          [-1, 128, 64, 64]               0
           Conv2d-42          [-1, 128, 64, 64]         147,456
      BatchNorm2d-43          [-1, 128, 64, 64]             256
             ReLU-44          [-1, 128, 64, 64]               0
           Conv2d-45          [-1, 128, 64, 64]         147,456
      BatchNorm2d-46          [-1, 128, 64, 64]             256
             ReLU-47          [-1, 128, 64, 64]               0
       BasicBlock-48          [-1, 128, 64, 64]               0
           Conv2d-49          [-1, 128, 64, 64]         147,456
      BatchNorm2d-50          [-1, 128, 64, 64]             256
             ReLU-51          [-1, 128, 64, 64]               0
           Conv2d-52          [-1, 128, 64, 64]         147,456
      BatchNorm2d-53          [-1, 128, 64, 64]             256
             ReLU-54          [-1, 128, 64, 64]               0
       BasicBlock-55          [-1, 128, 64, 64]               0
           Conv2d-56          [-1, 256, 32, 32]         294,912
      BatchNorm2d-57          [-1, 256, 32, 32]             512
             ReLU-58          [-1, 256, 32, 32]               0
           Conv2d-59          [-1, 256, 32, 32]         589,824
      BatchNorm2d-60          [-1, 256, 32, 32]             512
           Conv2d-61          [-1, 256, 32, 32]          32,768
      BatchNorm2d-62          [-1, 256, 32, 32]             512
             ReLU-63          [-1, 256, 32, 32]               0
       BasicBlock-64          [-1, 256, 32, 32]               0
           Conv2d-65          [-1, 256, 32, 32]         589,824
      BatchNorm2d-66          [-1, 256, 32, 32]             512
             ReLU-67          [-1, 256, 32, 32]               0
           Conv2d-68          [-1, 256, 32, 32]         589,824
      BatchNorm2d-69          [-1, 256, 32, 32]             512
             ReLU-70          [-1, 256, 32, 32]               0
       BasicBlock-71          [-1, 256, 32, 32]               0
           Conv2d-72          [-1, 256, 32, 32]         589,824
      BatchNorm2d-73          [-1, 256, 32, 32]             512
             ReLU-74          [-1, 256, 32, 32]               0
           Conv2d-75          [-1, 256, 32, 32]         589,824
      BatchNorm2d-76          [-1, 256, 32, 32]             512
             ReLU-77          [-1, 256, 32, 32]               0
       BasicBlock-78          [-1, 256, 32, 32]               0
           Conv2d-79          [-1, 256, 32, 32]         589,824
      BatchNorm2d-80          [-1, 256, 32, 32]             512
             ReLU-81          [-1, 256, 32, 32]               0
           Conv2d-82          [-1, 256, 32, 32]         589,824
      BatchNorm2d-83          [-1, 256, 32, 32]             512
             ReLU-84          [-1, 256, 32, 32]               0
       BasicBlock-85          [-1, 256, 32, 32]               0
           Conv2d-86          [-1, 256, 32, 32]         589,824
      BatchNorm2d-87          [-1, 256, 32, 32]             512
             ReLU-88          [-1, 256, 32, 32]               0
           Conv2d-89          [-1, 256, 32, 32]         589,824
      BatchNorm2d-90          [-1, 256, 32, 32]             512
             ReLU-91          [-1, 256, 32, 32]               0
       BasicBlock-92          [-1, 256, 32, 32]               0
           Conv2d-93          [-1, 256, 32, 32]         589,824
      BatchNorm2d-94          [-1, 256, 32, 32]             512
             ReLU-95          [-1, 256, 32, 32]               0
           Conv2d-96          [-1, 256, 32, 32]         589,824
      BatchNorm2d-97          [-1, 256, 32, 32]             512
             ReLU-98          [-1, 256, 32, 32]               0
       BasicBlock-99          [-1, 256, 32, 32]               0
          Conv2d-100          [-1, 512, 16, 16]       1,179,648
     BatchNorm2d-101          [-1, 512, 16, 16]           1,024
            ReLU-102          [-1, 512, 16, 16]               0
          Conv2d-103          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-104          [-1, 512, 16, 16]           1,024
          Conv2d-105          [-1, 512, 16, 16]         131,072
     BatchNorm2d-106          [-1, 512, 16, 16]           1,024
            ReLU-107          [-1, 512, 16, 16]               0
      BasicBlock-108          [-1, 512, 16, 16]               0
          Conv2d-109          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-110          [-1, 512, 16, 16]           1,024
            ReLU-111          [-1, 512, 16, 16]               0
          Conv2d-112          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-113          [-1, 512, 16, 16]           1,024
            ReLU-114          [-1, 512, 16, 16]               0
      BasicBlock-115          [-1, 512, 16, 16]               0
          Conv2d-116          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-117          [-1, 512, 16, 16]           1,024
            ReLU-118          [-1, 512, 16, 16]               0
          Conv2d-119          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-120          [-1, 512, 16, 16]           1,024
            ReLU-121          [-1, 512, 16, 16]               0
      BasicBlock-122          [-1, 512, 16, 16]               0
          Conv2d-123          [-1, 512, 16, 16]       2,359,808
          Conv2d-124          [-1, 512, 16, 16]       2,359,808
          Conv2d-125          [-1, 512, 16, 16]         262,656
          Conv2d-126          [-1, 512, 16, 16]       2,359,808
          Conv2d-127          [-1, 512, 16, 16]       2,359,808
          Conv2d-128          [-1, 512, 16, 16]         262,656
          Conv2d-129          [-1, 512, 16, 16]       2,359,808
          Conv2d-130          [-1, 512, 16, 16]       2,359,808
          Conv2d-131          [-1, 512, 16, 16]       2,359,808
          Conv2d-132          [-1, 512, 16, 16]         262,656
        DACblock-133          [-1, 512, 16, 16]               0
       MaxPool2d-134            [-1, 512, 8, 8]               0
          Conv2d-135              [-1, 1, 8, 8]             513
       MaxPool2d-136            [-1, 512, 5, 5]               0
          Conv2d-137              [-1, 1, 5, 5]             513
       MaxPool2d-138            [-1, 512, 3, 3]               0
          Conv2d-139              [-1, 1, 3, 3]             513
       MaxPool2d-140            [-1, 512, 2, 2]               0
          Conv2d-141              [-1, 1, 2, 2]             513
        SPPblock-142          [-1, 516, 16, 16]               0
          Conv2d-143          [-1, 129, 16, 16]          66,693
     BatchNorm2d-144          [-1, 129, 16, 16]             258
 ConvTranspose2d-145          [-1, 129, 32, 32]         149,898
     BatchNorm2d-146          [-1, 129, 32, 32]             258
          Conv2d-147          [-1, 256, 32, 32]          33,280
     BatchNorm2d-148          [-1, 256, 32, 32]             512
    DecoderBlock-149          [-1, 256, 32, 32]               0
          Conv2d-150           [-1, 64, 32, 32]          16,448
     BatchNorm2d-151           [-1, 64, 32, 32]             128
 ConvTranspose2d-152           [-1, 64, 64, 64]          36,928
     BatchNorm2d-153           [-1, 64, 64, 64]             128
          Conv2d-154          [-1, 128, 64, 64]           8,320
     BatchNorm2d-155          [-1, 128, 64, 64]             256
    DecoderBlock-156          [-1, 128, 64, 64]               0
          Conv2d-157           [-1, 32, 64, 64]           4,128
     BatchNorm2d-158           [-1, 32, 64, 64]              64
 ConvTranspose2d-159         [-1, 32, 128, 128]           9,248
     BatchNorm2d-160         [-1, 32, 128, 128]              64
          Conv2d-161         [-1, 64, 128, 128]           2,112
     BatchNorm2d-162         [-1, 64, 128, 128]             128
    DecoderBlock-163         [-1, 64, 128, 128]               0
          Conv2d-164         [-1, 16, 128, 128]           1,040
     BatchNorm2d-165         [-1, 16, 128, 128]              32
 ConvTranspose2d-166         [-1, 16, 256, 256]           2,320
     BatchNorm2d-167         [-1, 16, 256, 256]              32
          Conv2d-168         [-1, 64, 256, 256]           1,088
     BatchNorm2d-169         [-1, 64, 256, 256]             128
    DecoderBlock-170         [-1, 64, 256, 256]               0
 ConvTranspose2d-171         [-1, 32, 512, 512]          32,800
          Conv2d-172         [-1, 32, 512, 512]           9,248
          Conv2d-173          [-1, 1, 512, 512]             289
================================================================
Total params: 38,969,176
Trainable params: 38,969,176
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 820.93
Params size (MB): 148.66
Estimated Total Size (MB): 972.58
----------------------------------------------------------------
